DataProcessors/СредстваИндивидуальнойЗащиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СредстваИндивидуальнойЗащиты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОбновлениеВыдачСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОбновлениеВыдачСИЗ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПериодичностьВыдачиСИЗРабочихМест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПериодичностьВыдачиСИЗРабочихМест</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СИЗПолноеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СИЗКодыПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СИЗРабочегоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СИЗРабочегоМеста</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дежурное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВыданныеСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВыданныеСИЗ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Дежурное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/СформированныеЗаказыНаВыдачуСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>СформированныеЗаказыНаВыдачуСИЗ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаВыдачуСИЗ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВыдачуСИЗ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>АПК:58</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дежурное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ВыдачиСИЗПоНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыдачиСИЗПоНоменклатуре</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующейВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОснованиеВыдачи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеВыдачиСИЗ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РезультатыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выдано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыдано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокНоскиПродлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноВыдано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоИзноса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/СредстваИндивидуальнойЗащиты/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры["Организация"];
	КонецЕсли;
	
	ЗаполнитьНачальныеЗначения();
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	УстановитьПараметрТекущаяДата(ЭтотОбъект, ТекущаяДата);
	УстановитьОтборПоОрганизации(ЭтотОбъект);
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	
	УстановитьОтборТолькоБлижайшиеВыдачи(ЭтотОбъект, ТекущаяДата, ПоказыватьТолькоБлижайшиеВыдачи);
	ДоработатьПользовательскиеНастройкиСпискаРабочихМест();
	
	УстановитьУсловноеОформление();
	
	ВсеПозицииБезСИЗ = ВсеПозицииБезСИЗ(Организация);
	УстановитьНадписьПояснениеПустогоСпискаВыдачСИЗ(ЭтотОбъект, ВсеПозицииБезСИЗ);
	
	ЕстьНеактуальныеЗаписи = ЕстьНеактуальныеЗаписиВыдачиСИЗ(Организация);
	УстановитьНадписьОбновитьВыдачиСИЗ(ЭтотОбъект, ЕстьНеактуальныеЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ПроверитьНаличиеНеактуальныхЗаписейВыдачиСИЗ", 60);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьОтборПоОрганизации(ЭтотОбъект);
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	
	ВсеПозицииБезСИЗ = ВсеПозицииБезСИЗ(Организация);
	УстановитьНадписьПояснениеПустогоСпискаВыдачСИЗ(ЭтотОбъект, ВсеПозицииБезСИЗ);
	
	ЕстьНеактуальныеЗаписи = ЕстьНеактуальныеЗаписиВыдачиСИЗ(Организация);
	УстановитьНадписьОбновитьВыдачиСИЗ(ЭтотОбъект, ЕстьНеактуальныеЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НазначениеРабочихМестСотрудникам" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейВыдачиСИЗ();
		ОбновитьСписокВыдачиСИЗ();
	ИначеЕсли ИмяСобытия = "Запись_ПриемНаРаботу" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейВыдачиСИЗ();
		ОбновитьСписокВыдачиСИЗ();
	ИначеЕсли ИмяСобытия = "Запись_ПриемНаРаботуСписком" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейВыдачиСИЗ();
		ОбновитьСписокВыдачиСИЗ();
	ИначеЕсли ИмяСобытия = "Запись_КадровыйПеревод" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейВыдачиСИЗ();
		ОбновитьСписокВыдачиСИЗ();
	ИначеЕсли ИмяСобытия = "Запись_КадровыйПереводСписком" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейВыдачиСИЗ();
		ОбновитьСписокВыдачиСИЗ();
	ИначеЕсли ИмяСобытия = "Запись_ЗаказНаВыдачуСИЗ" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейВыдачиСИЗ();
		ОбновитьСписокВыдачиСИЗ();
	ИначеЕсли ИмяСобытия = "Запись_ВыдачаСИЗ" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейВыдачиСИЗ();
		ОбновитьСписокВыдачиСИЗ();
	ИначеЕсли ИмяСобытия = "Запись_РабочиеМестаОхраныТруда" Тогда
		ПроверитьНаличиеНеактуальныхЗаписейВыдачиСИЗ();
		Элементы.РабочиеМеста.Обновить();
		ОбновитьСписокВыдачиСИЗ();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьОтборПоОрганизации(ЭтотОбъект);
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	УстановитьОтборПоПодразделению(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТолькоБлижайшиеВыдачиПриИзменении(Элемент)
	УстановитьОтборТолькоБлижайшиеВыдачи(ЭтотОбъект, ОбщегоНазначенияКлиент.ДатаСеанса(), ПоказыватьТолькоБлижайшиеВыдачи);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДанныхНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьОбновлениеВыдачиСИЗ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыдачиСИЗ

&НаКлиенте
Процедура ВыдачиСИЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ВыдачиСИЗ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьСотрудника(ТекущиеДанные, Поле);
	ОткрытьРабочееМесто(ТекущиеДанные, Поле);
	ОткрытьЗаказНаВыдачу(ТекущиеДанные, Поле);
	ОткрытьВыдачу(ТекущиеДанные, Поле);
	ОткрытьРасшифровкуРезультатаВыдачи(ТекущиеДанные, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыдачиСИЗПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПриАктивизацииСтрокиВыдачиСИЗНаКлиенте", 0.1, Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыдачиСИЗПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	ОформитьСтрокиВыдачСИЗ(ИмяЭлемента, Настройки, Строки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРабочиеМеста

&НаКлиенте
Процедура РабочиеМестаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РабочиеМеста.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные["Ссылка"]);
	
	ОткрытьФорму("Справочник.РабочиеМестаОхраныТруда.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СписокВыдачиСИЗ

&НаКлиенте
Процедура ЗаказатьВыдачу(Команда)
	НачатьФормированиеЗаказаНаВыдачу(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьСИЗ(Команда)
	НачатьФормированиеВыдачиСИЗ(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьСрокНоски(Команда)
	НачатьФормированиеПродления(Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СписатьСИЗ(Команда)
	НачатьФормированиеСписания(Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНормыВыдачи(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Организация", Организация);
	ПараметрыОткрытия.Вставить("Подразделение", Подразделение);
	ПараметрыОткрытия.Вставить("РабочиеМеста", Элементы.РабочиеМеста.ВыделенныеСтроки);
	
	ОткрытьФорму("Обработка.СредстваИндивидуальнойЗащиты.Форма.ИзменениеНормВыдачиРабочихМест", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СписокСостоянияВыдачиСИЗ

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из СостоянияВыдачиСИЗСотрудника Цикл
		ТекущаяСтрока.Флажок = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого ТекущаяСтрока Из СостоянияВыдачиСИЗСотрудника Цикл
		ТекущаяСтрока.Флажок = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказатьВыдачуОтмеченныхСИЗ(Команда)
	НачатьФормированиеЗаказаНаВыдачу(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьОтмеченныеСИЗ(Команда)
	НачатьФормированиеВыдачиСИЗ(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьСрокНоскиОтмеченныхСИЗ(Команда)
	НачатьФормированиеПродления(Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьСрокНоскиОтмеченныхСИЗБезУчетаСрокаНоски(Команда)
	НачатьФормированиеПродления(Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СписатьОтмеченныеСИЗ(Команда)
	НачатьФормированиеСписания(Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписатьОтмеченныеСИЗБезУчетаСрокаНоски(Команда)
	НачатьФормированиеСписания(Истина, Ложь);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ФизическиеЛицаРабочиеМеста(ПоОтмеченнымСИЗ, ВидДокумента, ДополнительнаяКолонка)
	
	ДанныеСИЗ = Новый Массив;
	
	Если ПоОтмеченнымСИЗ Тогда
		ДанныеСтроки = Элементы.ВыдачиСИЗ.ТекущиеДанные;
		Описание = ОписаниеСтрокиВыдачиСИЗ();
		ЗаполнитьЗначенияСвойств(Описание, ДанныеСтроки);
		Для Каждого ВыделеннаяСтрока Из СостоянияВыдачиСИЗСотрудника.НайтиСтроки(Новый Структура("Флажок", Истина)) Цикл
			Если ВидДокумента = ВидДокумента().ЗаказНаВыдачу Тогда
				КоличествоОжидаетВыдачи = ВыделеннаяСтрока.КоличествоОжидаетВыдачи;
				Если ДополнительнаяКолонка = ИменаКолонокКоличества().ДоВыдачиМеньшеМесяца Тогда
					КоличествоОжидаетВыдачи = КоличествоОжидаетВыдачи + ВыделеннаяСтрока.КоличествоДоВыдачиМеньшеМесяца;
				КонецЕсли;
				Если КоличествоОжидаетВыдачи > 0 Тогда
					Описание.ОтмеченныеСИЗ.Добавить(ВыделеннаяСтрока.СИЗ);
				КонецЕсли;
			ИначеЕсли ВыделеннаяСтрока.КоличествоЗаказано > 0 И ВидДокумента = ВидДокумента().Выдача Тогда
				Описание.ОтмеченныеСИЗ.Добавить(ВыделеннаяСтрока.СИЗ);
			ИначеЕсли (ВидДокумента = ВидДокумента().Продление Или ВидДокумента = ВидДокумента().Списание)
				И ?(ДополнительнаяКолонка = ИменаКолонокКоличества().НаРуках, ВыделеннаяСтрока.КоличествоНаРуках > 0, ВыделеннаяСтрока.КоличествоНужноОбновить > 0) Тогда
				Описание.ОтмеченныеСИЗ.Добавить(ВыделеннаяСтрока.СИЗ);
			ИначеЕсли ВыделеннаяСтрока.КоличествоТребуетсяСписание > 0 И ВидДокумента = ВидДокумента().Списание Тогда
				Описание.ОтмеченныеСИЗ.Добавить(ВыделеннаяСтрока.СИЗ);
			КонецЕсли;
		КонецЦикла;
		ДанныеСИЗ.Добавить(Описание);
	Иначе
		Для Каждого ВыделеннаяСтрока Из Элементы.ВыдачиСИЗ.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.ВыдачиСИЗ.ДанныеСтроки(ВыделеннаяСтрока);
			Описание = ОписаниеСтрокиВыдачиСИЗ();
			ЗаполнитьЗначенияСвойств(Описание, ДанныеСтроки);
			ДанныеСИЗ.Добавить(Описание);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеСИЗ;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеСтрокиВыдачиСИЗ()
	
	Описание = Новый Структура;
	Описание.Вставить("ФизическоеЛицо");
	Описание.Вставить("РабочееМесто");
	Описание.Вставить("ЗаказНаВыдачу");
	Описание.Вставить("ВыдачаСИЗ");
	Описание.Вставить("ОтмеченныеСИЗ", Новый Массив);
	
	Возврат Описание;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидДокумента()
	
	ВидыДокументов = Новый Структура;
	ВидыДокументов.Вставить("ЗаказНаВыдачу", НСтр("ru = 'Заказ на выдачу'"));
	ВидыДокументов.Вставить("Выдача", НСтр("ru = 'Выдача СИЗ'"));
	ВидыДокументов.Вставить("Продление", НСтр("ru = 'Продление сроков носки'"));
	ВидыДокументов.Вставить("Списание", НСтр("ru = 'Списание СИЗ из эксплуатации'"));
	
	Возврат ВидыДокументов;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИменаКолонокКоличества()
	
	ИменаКолонокКоличества = Новый Структура;
	ИменаКолонокКоличества.Вставить("ДоВыдачиМеньшеМесяца", "КоличествоДоВыдачиМеньшеМесяца");
	ИменаКолонокКоличества.Вставить("НаРуках", "КоличествоНаРуках");
	
	Возврат ИменаКолонокКоличества;
	
КонецФункции

#Область ФормированиеЗаказаНаВыдачу

&НаКлиенте
Процедура НачатьФормированиеЗаказаНаВыдачу(ПоОтмеченнымСИЗ)
	
	Если Элементы.ВыдачиСИЗ.ВыделенныеСтроки.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрано ни одного сотрудника'");
	КонецЕсли;
	
	Если ПоОтмеченнымСИЗ Тогда
		ОтмеченныеСтроки = СостоянияВыдачиСИЗСотрудника.НайтиСтроки(Новый Структура("Флажок", Истина));
		Если ОтмеченныеСтроки.Количество() = 0  Тогда
			ВызватьИсключение НСтр("ru = 'Не отмечено ни одного СИЗ'");
		КонецЕсли;
		ОтмеченыГотовыеКЗаказуСтроки = Ложь;
		Для Каждого ОтмеченнаяСтрока Из ОтмеченныеСтроки Цикл
			Если ОтмеченнаяСтрока.КоличествоОжидаетВыдачи > 0 Или ОтмеченнаяСтрока.КоличествоДоВыдачиМеньшеМесяца > 0 Тогда
				ОтмеченыГотовыеКЗаказуСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ОтмеченыГотовыеКЗаказуСтроки Тогда
			ВызватьИсключение НСтр("ru = 'Не отмечено ни одного СИЗ подходящего к заказу на выдачу'");
		КонецЕсли;
	КонецЕсли;
	
	НачатьВводЗаказаНаВыдачу(ПоОтмеченнымСИЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводЗаказаНаВыдачу(ПоОтмеченнымСИЗ)
	
	Если ПоОтмеченнымСИЗ Тогда
		Для Каждого Строка Из СостоянияВыдачиСИЗСотрудника Цикл
			Если Строка.Флажок И ЗначениеЗаполнено(Строка.ПоследнийЗаказНаВыдачу) И Строка.КоличествоЗаказано > 0 Тогда
				ПоказатьВопросЗаказНаВыдачуСуществует(Строка.ПоследнийЗаказНаВыдачу, ПоОтмеченнымСИЗ);
				Возврат;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ВыделеннаяСтрока Из Элементы.ВыдачиСИЗ.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.ВыдачиСИЗ.ДанныеСтроки(ВыделеннаяСтрока);
			Если ЗначениеЗаполнено(ДанныеСтроки.ЗаказНаВыдачу) И Не ДанныеСтроки.ВыданыСИЗ Тогда
				ПоказатьВопросЗаказНаВыдачуСуществует(ДанныеСтроки.ЗаказНаВыдачу, ПоОтмеченнымСИЗ);
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВвестиНовыйЗаказНаВыдачу(ПоОтмеченнымСИЗ);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьВопросЗаказНаВыдачуСуществует(ЗаказНаВыдачу, ПоОтмеченнымСИЗ)
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Для сотрудника уже введен документ %1, выдача по которому пока не проведена.'"), ЗаказНаВыдачу);
		
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Прервать, НСтр("ru = 'Открыть существующий'"));
	Кнопки.Добавить(КодВозвратаДиалога.Пропустить, НСтр("ru = 'Создать новый'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗаказНаВыдачу", ЗаказНаВыдачу);
	ДополнительныеПараметры.Вставить("ПоОтмеченнымСИЗ", ПоОтмеченнымСИЗ);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ВвестиНовыйЗаказНаВыдачуПослеВопросаЗаказНаВыдачуСуществует", ЭтотОбъект,
		ДополнительныеПараметры);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросЕстьИстекающиеВТечениеМесяца(ПоОтмеченным)
	
	ТекстВопроса = НСтр("ru = 'Найдены СИЗ, у которых срок носки еще не истек, но истечет в течение следующего месяца.'");
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Добавить в заказ'"));
	Кнопки.Добавить(КодВозвратаДиалога.Пропустить, НСтр("ru = 'Не добавлять'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ВвестиНовыйЗаказНаВыдачуПослеВопросаЕстьИстекающиеВТечениеМесяца",
		ЭтотОбъект, Новый Структура("ПоОтмеченным", ПоОтмеченным));
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовыйЗаказНаВыдачуПослеВопросаЗаказНаВыдачуСуществует(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Прервать Тогда
		ПоказатьЗначение(, ДополнительныеПараметры.ЗаказНаВыдачу);
		Возврат;
	КонецЕсли;
	
	ВвестиНовыйЗаказНаВыдачу(ДополнительныеПараметры.ПоОтмеченнымСИЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовыйЗаказНаВыдачуПослеВопросаЕстьИстекающиеВТечениеМесяца(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительнаяКолонка = Неопределено;
	Если Результат = КодВозвратаДиалога.ОК Тогда
		ДополнительнаяКолонка = ИменаКолонокКоличества().ДоВыдачиМеньшеМесяца;
	КонецЕсли;
	
	ПараметрыФормы = ПараметрыФормыНовогоДокумента(
		ДополнительныеПараметры.ПоОтмеченным, ВидДокумента().ЗаказНаВыдачу, ДополнительнаяКолонка);
	Если ДополнительнаяКолонка = ИменаКолонокКоличества().ДоВыдачиМеньшеМесяца Тогда
		ПараметрыФормы.ЗначенияЗаполнения.Вставить("ВключатьСИЗИстекающиеВТечениеМесяца", Истина);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказНаВыдачуСИЗ.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовыйЗаказНаВыдачу(ПоОтмеченнымСИЗ)
	
	Если ПоОтмеченнымСИЗ Тогда
		Для Каждого Строка Из СостоянияВыдачиСИЗСотрудника Цикл
			Если Строка.Флажок И Строка.КоличествоДоВыдачиМеньшеМесяца > 0 Тогда
				ПоказатьВопросЕстьИстекающиеВТечениеМесяца(ПоОтмеченнымСИЗ);
				Возврат;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ДатаАктуальности = ДатаАктуальности();
		ДатаАктуальностиМесяцВперед = ДобавитьМесяц(ДатаАктуальности, 1);
		Для Каждого ВыделеннаяСтрока Из Элементы.ВыдачиСИЗ.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.ВыдачиСИЗ.ДанныеСтроки(ВыделеннаяСтрока);
			Если ДанныеСтроки.ДатаСледующейВыдачи > ДатаАктуальности
			 И ДанныеСтроки.ДатаСледующейВыдачи <= ДатаАктуальностиМесяцВперед Тогда
				ПоказатьВопросЕстьИстекающиеВТечениеМесяца(ПоОтмеченнымСИЗ);
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ЗаказНаВыдачуСИЗ.ФормаОбъекта",
		ПараметрыФормыНовогоДокумента(ПоОтмеченнымСИЗ, ВидДокумента().ЗаказНаВыдачу), ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаАктуальности()
	Возврат НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
КонецФункции

#КонецОбласти

#Область ФормированиеВыдачи

&НаКлиенте
Процедура НачатьФормированиеВыдачиСИЗ(ПоОтмеченнымСИЗ)
	
	Если Элементы.ВыдачиСИЗ.ВыделенныеСтроки.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрано ни одного сотрудника'");
	КонецЕсли;
	
	Если ПоОтмеченнымСИЗ Тогда
		ОтмеченныеСтроки = СостоянияВыдачиСИЗСотрудника.НайтиСтроки(Новый Структура("Флажок", Истина));
		Если ОтмеченныеСтроки.Количество() = 0  Тогда
			ВызватьИсключение НСтр("ru = 'Не отмечено ни одного СИЗ'");
		КонецЕсли;
		ОтмеченыГотовыеКВыдачеСтроки = Ложь;
		Для Каждого ОтмеченнаяСтрока Из ОтмеченныеСтроки Цикл
			Если ОтмеченнаяСтрока.КоличествоЗаказано > 0 Тогда
				ОтмеченыГотовыеКВыдачеСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ОтмеченыГотовыеКВыдачеСтроки Тогда
			ВызватьИсключение НСтр("ru = 'Не отмечено ни одного СИЗ подходящего для выдачи'");
		КонецЕсли;
	КонецЕсли;
	
	НачатьВводВыдачиСИЗ(ПоОтмеченнымСИЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводВыдачиСИЗ(ПоОтмеченнымСИЗ)
	
	Если Не ПоОтмеченнымСИЗ Тогда
		Для Каждого ВыделеннаяСтрока Из Элементы.ВыдачиСИЗ.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.ВыдачиСИЗ.ДанныеСтроки(ВыделеннаяСтрока);
			Если Не ЗначениеЗаполнено(ДанныеСтроки.ЗаказНаВыдачу) Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Для %1 отсутствует заказ на выдачу.
					|Выдачу можно ввести только при наличии заказа.'"), ДанныеСтроки.ФизическоеЛицо);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеСтроки.ВыдачаСИЗ) Тогда
				Если Не ДанныеСтроки.ВыданыСИЗ Тогда
					ПоказатьВопросВыдачаСИЗСуществует(ДанныеСтроки, ПоОтмеченнымСИЗ);
					Возврат;
				КонецЕсли;
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Для %1 СИЗ уже выданы.
					|Выдачу можно ввести только при наличии заказа, по которому нет выдачи.'"), ДанныеСтроки.ФизическоеЛицо);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВвестиНовуюВыдачуСИЗ(ПоОтмеченнымСИЗ);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьВопросВыдачаСИЗСуществует(ТекущиеДанные, ПоОтмеченнымСИЗ)
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Для %1 уже введен документ %2, который пока не проведен.'"),
		ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.ВыдачаСИЗ);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Прервать, НСтр("ru = 'Открыть существующий'"));
	Кнопки.Добавить(КодВозвратаДиалога.Пропустить, НСтр("ru = 'Создать новый'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыдачаСИЗ", ТекущиеДанные.ВыдачаСИЗ);
	ДополнительныеПараметры.Вставить("ПоОтмеченнымСИЗ", ПоОтмеченнымСИЗ);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ВвестиНовуюВыдачуПослеВопросаВыдачаСуществует", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовуюВыдачуПослеВопросаВыдачаСуществует(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Прервать Тогда
		ПоказатьЗначение(, ДополнительныеПараметры.ВыдачаСИЗ);
		Возврат;
	КонецЕсли;
	
	ВвестиНовуюВыдачуСИЗ(ДополнительныеПараметры.ПоОтмеченнымСИЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовуюВыдачуСИЗ(ПоОтмеченнымСИЗ)
	
	ОткрытьФорму("Документ.ВыдачаСИЗ.ФормаОбъекта", 
		ПараметрыФормыНовогоДокумента(ПоОтмеченнымСИЗ, ВидДокумента().Выдача), ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеПродления

&НаКлиенте
Процедура НачатьФормированиеПродления(ПоОтмеченнымСИЗ, УчитыватьИстекшийСрокНоски)
	
	Если Элементы.ВыдачиСИЗ.ВыделенныеСтроки.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрано ни одного сотрудника'");
	КонецЕсли;
	
	Если ПоОтмеченнымСИЗ Тогда
		ОтмеченныеСтроки = СостоянияВыдачиСИЗСотрудника.НайтиСтроки(Новый Структура("Флажок", Истина));
		Если ОтмеченныеСтроки.Количество() = 0  Тогда
			ВызватьИсключение НСтр("ru = 'Не отмечено ни одного СИЗ'");
		КонецЕсли;
		ОтмеченыГотовыеКПродлениюСтроки = Ложь;
		Для Каждого ОтмеченнаяСтрока Из ОтмеченныеСтроки Цикл
			Если ОтмеченнаяСтрока.КоличествоНужноОбновить > 0
			 Или ?(УчитыватьИстекшийСрокНоски, Ложь, ОтмеченнаяСтрока.КоличествоНаРуках > 0) Тогда
				ОтмеченыГотовыеКПродлениюСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ОтмеченыГотовыеКПродлениюСтроки Тогда
			ВызватьИсключение НСтр("ru = 'Не отмечено ни одного СИЗ подходящего для продления'");
		КонецЕсли;
	КонецЕсли;
	
	ВвестиНовоеПродление(ПоОтмеченнымСИЗ, УчитыватьИстекшийСрокНоски);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовоеПродление(ПоОтмеченнымСИЗ, УчитыватьИстекшийСрокНоски)
	
	ДополнительнаяКолонка = Неопределено;
	Если Не УчитыватьИстекшийСрокНоски Тогда
		ДополнительнаяКолонка = ИменаКолонокКоличества().НаРуках;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПродлениеСроковНоскиСИЗ.ФормаОбъекта", 
		ПараметрыФормыНовогоДокумента(ПоОтмеченнымСИЗ, ВидДокумента().Продление, ДополнительнаяКолонка), ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеСписания

&НаКлиенте
Процедура НачатьФормированиеСписания(ПоОтмеченнымСИЗ, УчитыватьИстекшийСрокНоски)
	
	Если Элементы.ВыдачиСИЗ.ВыделенныеСтроки.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не выбрано ни одного сотрудника'");
	КонецЕсли;
	
	Если ПоОтмеченнымСИЗ Тогда
		ОтмеченныеСтроки = СостоянияВыдачиСИЗСотрудника.НайтиСтроки(Новый Структура("Флажок", Истина));
		Если ОтмеченныеСтроки.Количество() = 0  Тогда
			ВызватьИсключение НСтр("ru = 'Не отмечено ни одного СИЗ'");
		КонецЕсли;
		ОтмеченыГотовыеКСписаниюСтроки = Ложь;
		Для Каждого ОтмеченнаяСтрока Из ОтмеченныеСтроки Цикл
			Если ОтмеченнаяСтрока.КоличествоТребуетсяСписание > 0 Или ОтмеченнаяСтрока.КоличествоНужноОбновить > 0
			 Или ?(УчитыватьИстекшийСрокНоски, Ложь, ОтмеченнаяСтрока.КоличествоНаРуках > 0) Тогда
				ОтмеченыГотовыеКСписаниюСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ОтмеченыГотовыеКСписаниюСтроки Тогда
			ВызватьИсключение НСтр("ru = 'Не отмечено ни одного СИЗ подходящего для списания'");
		КонецЕсли;
	КонецЕсли;
	
	ВвестиНовоеСписание(ПоОтмеченнымСИЗ, УчитыватьИстекшийСрокНоски);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНовоеСписание(ПоОтмеченнымСИЗ, УчитыватьИстекшийСрокНоски)
	
	ДополнительнаяКолонка = Неопределено;
	Если Не УчитыватьИстекшийСрокНоски Тогда
		ДополнительнаяКолонка = ИменаКолонокКоличества().НаРуках;
	КонецЕсли;
	
	ОткрытьФорму("Документ.СписаниеСИЗИзЭксплуатации.ФормаОбъекта", 
		ПараметрыФормыНовогоДокумента(ПоОтмеченнымСИЗ, ВидДокумента().Списание, ДополнительнаяКолонка), ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбновитьСписокВыдачиСИЗ()
	
	Элементы.ВыдачиСИЗ.Обновить();
	
	ВыбранноеРабочееМесто = Неопределено;
	ВыбранноеФизическоеЛицо = Неопределено;
	ПодключитьОбработчикОжидания("ПриАктивизацииСтрокиВыдачиСИЗНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеНеактуальныхЗаписейВыдачиСИЗ()
	
	БылиНеАктуальныеЗаписи = Элементы.ОбновлениеДанныхГруппа.Видимость;
	
	ЕстьНеактуальныеЗаписи = ЕстьНеактуальныеЗаписиВыдачиСИЗ(Организация);
	УстановитьНадписьОбновитьВыдачиСИЗ(ЭтотОбъект, ЕстьНеактуальныеЗаписи);
	
	ВсеПозицииБезСИЗ = ВсеПозицииБезСИЗ(Организация);
	УстановитьНадписьПояснениеПустогоСпискаВыдачСИЗ(ЭтотОбъект, ВсеПозицииБезСИЗ);
	
	Если БылиНеАктуальныеЗаписи И Не ЕстьНеактуальныеЗаписи Тогда
		Элементы.ВыдачиСИЗ.Обновить();
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьСотрудника(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.ФизическоеЛицо Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудник = СотрудникПоФизическомуЛицу(ТекущиеДанные["ФизическоеЛицо"], ТекущиеДанные["РабочееМесто"], Организация);
	
	ПоказатьЗначение(, Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРабочееМесто(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.РабочееМесто Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ");
	ПараметрыФормы.Ключ = ТекущиеДанные["РабочееМесто"];
	
	Если Не ЗначениеЗаполнено(ПараметрыФормы.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.РабочиеМестаОхраныТруда.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказНаВыдачу(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.ЗаказНаВыдачу Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные["ЗаказНаВыдачу"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыдачу(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.ВыдачаСИЗ Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные["ВыдачаСИЗ"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасшифровкуРезультатаВыдачи(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.РезультатВыдачи Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные["ФизическоеЛицо"]) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ФизическоеЛицо", ТекущиеДанные["ФизическоеЛицо"]);
	ПараметрыОткрытия.Вставить("РабочееМесто", ТекущиеДанные["РабочееМесто"]);
	ПараметрыОткрытия.Вставить("Организация", Организация);
	
	ОткрытьФорму("Обработка.СредстваИндивидуальнойЗащиты.Форма.РезультатыВыдачи", ПараметрыОткрытия,, Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СотрудникПоФизическомуЛицу(ФизическоеЛицо, РабочееМесто, Организация)
	
	Возврат ОхранаТруда.СотрудникПоФизическомуЛицу(ФизическоеЛицо, РабочееМесто, Организация);
	
КонецФункции

&НаКлиенте
Процедура НачатьОбновлениеВыдачиСИЗ()
	
	ДлительнаяОперация = ОбновитьВыдачиСИЗНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Обновление сведений о выданных СИЗ'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеВыдачиСИЗЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеВыдачиСИЗЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеНеактуальныхЗаписейВыдачиСИЗ();
	
КонецПроцедуры 

&НаСервере
Функция ОбновитьВыдачиСИЗНаСервере()
	
	ПараметрыПроцедуры = Новый Структура("Организация");
	ПараметрыПроцедуры.Организация = Организация;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление сведений о выданных СИЗ'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"СредстваИндивидуальнойЗащиты.ОбновитьВыдачиСИЗОрганизацииДлительнаяОперация", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНачальныеЗначения()
	
	ЗначенияДляЗаполнения = Новый Структура;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ЗначенияДляЗаполнения.Вставить("Организация", "Организация");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		ЗначенияДляЗаполнения.Вставить("Подразделение", "Подразделение");
	КонецЕсли;
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрТекущаяДата(Форма, ТекущаяДата)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.ВыдачиСИЗ, "ТекущаяДата", ТекущаяДата);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.РабочиеМеста, "ТекущаяДата", ТекущаяДата);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоОрганизации(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.РабочиеМеста, "Организация", Форма.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Форма.ВыдачиСИЗ, "Организация", Форма.Организация);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоПодразделению(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.РабочиеМеста, "Подразделение", Форма.Подразделение,
		ВидСравненияКомпоновкиДанных.ВИерархии, , ЗначениеЗаполнено(Форма.Подразделение));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.ВыдачиСИЗ, "Подразделение", Форма.Подразделение,
		ВидСравненияКомпоновкиДанных.ВИерархии, , ЗначениеЗаполнено(Форма.Подразделение));
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	
	// Просрочена выдача.
	ЭлементОформления = ВыдачиСИЗ.УсловноеОформление.Элементы.Добавить();
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ДатаСледующейВыдачи", Сегодня, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "РезультатВыдачи", Перечисления.РезультатыВыдачиСИЗ.ЧастичноВыдано);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаКритичногоСостоянияОхраныТруда);
	
	// Выдача до износа.
	ЭлементОформления = ВыдачиСИЗ.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "СпособВыдачи", Перечисления.СпособыВыдачиСИЗ.ДоИзноса);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '< До износа >'"));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ДатаСледующейВыдачи");
	
	// Нет результата.
	ЭлементОформления = ВыдачиСИЗ.УсловноеОформление.Элементы.Добавить();
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "РезультатВыдачи", Перечисления.РезультатыВыдачиСИЗ.НеВыдано);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "РезультатВыдачи", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ВажнаяНадписьШрифт);
	
	// Не выданы.
	ЭлементОформления = ВыдачиСИЗ.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "РезультатВыдачи", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не выдано'"));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("РезультатВыдачи");
	
	// Срок носки истек.
	ЭлементОформления = ВыдачиСИЗ.УсловноеОформление.Элементы.Добавить();
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ДатаСледующейВыдачи", Сегодня, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "РезультатВыдачи", Перечисления.РезультатыВыдачиСИЗ.Выдано);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Выдано, но срок носки истек'"));
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("РезультатВыдачи");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОформитьСтрокиВыдачСИЗ(ИмяЭлемента, Настройки, Строки)
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	
	Для Каждого СтрокаСписка Из Строки Цикл
		ДанныеСтроки = СтрокаСписка.Значение.Данные;
		ОформлениеСтроки = СтрокаСписка.Значение.Оформление;
		ОтображатьКартинкуПредупреждение = Ложь;
		ТекстСостояния = Неопределено;
		Если ДанныеСтроки.ДатаСледующейВыдачи > Сегодня И ДанныеСтроки.ДатаСледующейВыдачи < ДобавитьМесяц(Сегодня, 1) Тогда
			// До выдачи меньше месяца.
			ТекстСостояния = НСтр("ru = 'До выдачи меньше месяца'");
		ИначеЕсли ДанныеСтроки.ДатаСледующейВыдачи <= Сегодня Тогда
			// Выдача просрочена или не СИЗ не выдавались.
			ТекстСостояния = НСтр("ru = 'Выдать СИЗ немедленно'");
			ОтображатьКартинкуПредупреждение = Истина;
		ИначеЕсли ДанныеСтроки.РезультатВыдачи = Перечисления.РезультатыВыдачиСИЗ.НеВыдано Тогда
			// Спецодежда не выдана.
			ТекстСостояния = НСтр("ru = 'Спецодежда не выдана, требуется отстранение от работы'");
			ОтображатьКартинкуПредупреждение = Истина;
		КонецЕсли;
		// В процессе выдачи.
		Если ЗначениеЗаполнено(ДанныеСтроки.ЗаказНаВыдачу) И Не ЗначениеЗаполнено(ДанныеСтроки.РезультатВыдачи) Тогда
			ОтображатьКартинкуПредупреждение = Ложь;
			Если ЗначениеЗаполнено(ДанныеСтроки.ВыдачаСИЗ) Тогда
				ТекстСостояния = НСтр("ru = 'Выдача подготовлена, но документ не проведен'");
			Иначе
				ТекстСостояния = НСтр("ru = 'Сформирован заказ на выдачу, выдачи пока нет'");
			КонецЕсли;
		КонецЕсли;
		Если Не ОтображатьКартинкуПредупреждение Тогда
			УстановитьЗначениеПараметраОформленияПоля(ОформлениеСтроки, "ПредупреждениеКартинка", "Отображать", Ложь);
		КонецЕсли;
		УстановитьЗначениеПараметраОформленияПоля(ОформлениеСтроки, "СостояниеВыдачи", "Текст", ТекстСостояния);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеПараметраОформленияПоля(ОформлениеСтроки, ИмяПоля, Параметр, Значение)
	
	ОформлениеЯчейки = ОформлениеСтроки.Получить(ИмяПоля);
	
	Если ОформлениеЯчейки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОформлениеЯчейки.УстановитьЗначениеПараметра(Параметр, Значение);
	
КонецПроцедуры

&НаСервере
Процедура ДоработатьПользовательскиеНастройкиСпискаРабочихМест()
	
	Элементы.РабочиеМеста.СоздатьЭлементыФормыПользовательскихНастроек(Элементы.ПользовательскиеНастройкиРабочихМестГруппа);
	Для Каждого ЭлементНастроек Из Элементы.ПользовательскиеНастройкиРабочихМестГруппа.ПодчиненныеЭлементы Цикл
		Если ЭлементНастроек.Вид = ВидПоляФормы.ПолеФлажка Тогда
			ЭлементНастроек.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборТолькоБлижайшиеВыдачи(Форма, ТекущаяДата, Использование)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.ВыдачиСИЗ, 
		"ДатаСледующейВыдачи", 
		ДобавитьМесяц(НачалоДня(ТекущаяДата), 1), 
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, , 
		Использование);
		
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ВсеПозицииБезСИЗ = ВсеПозицииБезСИЗ(Организация);
	УстановитьНадписьПояснениеПустогоСпискаВыдачСИЗ(ЭтотОбъект, ВсеПозицииБезСИЗ);
	
	ЕстьНеактуальныеЗаписи = ЕстьНеактуальныеЗаписиВыдачиСИЗ(Организация);
	УстановитьНадписьОбновитьВыдачиСИЗ(ЭтотОбъект, ЕстьНеактуальныеЗаписи);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНадписьПояснениеПустогоСпискаВыдачСИЗ(Форма, ВсеПозицииБезСИЗ)
	
	Форма.Элементы.ПояснениеИспользованияГруппа.Видимость = ВсеПозицииБезСИЗ;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНадписьОбновитьВыдачиСИЗ(Форма, ЕстьНеактуальныеЗаписи)
	
	Форма.Элементы.ОбновлениеДанныхГруппа.Видимость = ЕстьНеактуальныеЗаписи;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьНеактуальныеЗаписиВыдачиСИЗ(Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(Организация));
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.ОбновлениеВыдачСИЗ КАК ОбновлениеВыдачСИЗ
		|ГДЕ
		|	ОбновлениеВыдачСИЗ.ГоловнаяОрганизация = &ГоловнаяОрганизация";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Функция ВсеПозицииБезСИЗ(Организация)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПериодичностьВыдачиСИЗРабочихМест КАК ПериодичностьРабочихМест
		|		ПО (РабочиеМестаОхраныТруда.Ссылка = ПериодичностьРабочихМест.РабочееМесто)
		|		И (РабочиеМестаОхраныТруда.Владелец = &Организация)";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Функция ПараметрыФормыНовогоДокумента(ПоОтмеченнымСИЗ, ВидДокумента, ДополнительнаяКолонка = Неопределено)
	
	ЗначенияЗаполнения = Новый Структура("Организация, ФизическиеЛицаРабочиеМеста");
	ЗначенияЗаполнения.Организация = Организация;
	ЗначенияЗаполнения.ФизическиеЛицаРабочиеМеста =
		ФизическиеЛицаРабочиеМеста(ПоОтмеченнымСИЗ, ВидДокумента, ДополнительнаяКолонка);
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ЗначенияЗаполнения.Вставить("Подразделение", Подразделение);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения");
	ПараметрыФормы.ЗначенияЗаполнения = ЗначенияЗаполнения;
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ПриАктивизацииСтрокиВыдачиСИЗНаКлиенте()
	
	Если Элементы.ВыдачиСИЗ.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РабочееМесто = Элементы.ВыдачиСИЗ.ТекущиеДанные.РабочееМесто;
	ФизическоеЛицо = Элементы.ВыдачиСИЗ.ТекущиеДанные.ФизическоеЛицо;
	
	Если РабочееМесто = ВыбранноеРабочееМесто И ФизическоеЛицо = ВыбранноеФизическоеЛицо Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранноеРабочееМесто = РабочееМесто;
	ВыбранноеФизическоеЛицо = ФизическоеЛицо;
	
	ЗаполнитьТаблицуСостоянийСИЗСотрудника();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСостоянийСИЗСотрудника()
	
	СостоянияВыдачиСИЗСотрудника.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочееМесто", ВыбранноеРабочееМесто);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ВыбранноеФизическоеЛицо);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаСледующегоМесяца", ДобавитьМесяц(Запрос.Параметры.ТекущаяДата, 1));
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбъединенныйЗапрос.СИЗ,
		|	ИСТИНА КАК Флажок,
		|	ОбъединенныйЗапрос.ЕдиницаИзмерения,
		|	СУММА(ОбъединенныйЗапрос.Количество) КАК Количество,
		|	СУММА(ОбъединенныйЗапрос.КоличествоНаРуках) КАК КоличествоНаРуках,
		|	СУММА(ОбъединенныйЗапрос.КоличествоЗаказано) КАК КоличествоЗаказано,
		|	СУММА(ОбъединенныйЗапрос.КоличествоНужноОбновить) КАК КоличествоНужноОбновить,
		|	СУММА(ОбъединенныйЗапрос.КоличествоДоВыдачиМеньшеМесяца) КАК КоличествоДоВыдачиМеньшеМесяца,
		|	ОбъединенныйЗапрос.НормаВыдачи,
		|	ОбъединенныйЗапрос.НаРуках,
		|	ОбъединенныйЗапрос.ОжидаетВыдачи,
		|	ОбъединенныйЗапрос.НужноОбновить,
		|	ОбъединенныйЗапрос.ДоВыдачиМеньшеМесяца,
		|	ОбъединенныйЗапрос.ТребуетсяСписание,
		|	ОбъединенныйЗапрос.Заказано,
		|	ОбъединенныйЗапрос.Выдано,
		|	МАКСИМУМ(ОбъединенныйЗапрос.ЗаказНаВыдачу) КАК ПоследнийЗаказНаВыдачу,
		|	МАКСИМУМ(ОбъединенныйЗапрос.ВыдачаСИЗ) КАК ПоследняяВыдачаСИЗ
		|ИЗ
		|	(ВЫБРАТЬ
		|		СИЗРабочегоМеста.СИЗ,
		|		СИЗРабочегоМеста.ЕдиницаИзмерения,
		|		СИЗРабочегоМеста.Количество,
		|		0 КАК КоличествоНаРуках,
		|		0 КАК КоличествоЗаказано,
		|		0 КАК КоличествоНужноОбновить,
		|		0 КАК КоличествоДоВыдачиМеньшеМесяца,
		|		"""" КАК НормаВыдачи,
		|		"""" КАК НаРуках,
		|		"""" КАК ОжидаетВыдачи,
		|		"""" КАК НужноОбновить,
		|		"""" КАК ДоВыдачиМеньшеМесяца,
		|		"""" КАК ТребуетсяСписание,
		|		"""" КАК Заказано,
		|		"""" КАК Выдано,
		|		NULL КАК ЗаказНаВыдачу,
		|		NULL КАК ВыдачаСИЗ
		|	ИЗ
		|		РегистрСведений.СИЗРабочегоМеста КАК СИЗРабочегоМеста
		|	ГДЕ
		|		СИЗРабочегоМеста.РабочееМесто = &РабочееМесто
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ВыданныеСИЗОстатки.СИЗ,
		|		ВыданныеСИЗОстатки.ЕдиницаИзмерения,
		|		0,
		|		ВыданныеСИЗОстатки.КоличествоОстаток,
		|		0,
		|		0,
		|		0,
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		ВыданныеСИЗОстатки.ОснованиеВыдачи,
		|		ВыданныеСИЗОстатки.ДокументВыдачи
		|	ИЗ
		|		РегистрНакопления.ВыданныеСИЗ.Остатки(&ТекущаяДата, ФизическоеЛицо = &ФизическоеЛицо) КАК ВыданныеСИЗОстатки
		|	ГДЕ
		|		ВыданныеСИЗОстатки.КоличествоОстаток > 0
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		СформированныеЗаказыНаВыдачуСИЗОстатки.СИЗ,
		|		СформированныеЗаказыНаВыдачуСИЗОстатки.ЕдиницаИзмерения,
		|		0,
		|		0,
		|		СформированныеЗаказыНаВыдачуСИЗОстатки.КоличествоОстаток,
		|		0,
		|		0,
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		СформированныеЗаказыНаВыдачуСИЗОстатки.ЗаказНаВыдачуСИЗ,
		|		NULL
		|	ИЗ
		|		РегистрНакопления.СформированныеЗаказыНаВыдачуСИЗ.Остатки(&ТекущаяДата, ФизическоеЛицо = &ФизическоеЛицо) КАК
		|			СформированныеЗаказыНаВыдачуСИЗОстатки
		|	ГДЕ
		|		СформированныеЗаказыНаВыдачуСИЗОстатки.КоличествоОстаток > 0
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ВыданныеСИЗОстатки.СИЗ,
		|		ВыданныеСИЗОстатки.ЕдиницаИзмерения,
		|		0,
		|		0,
		|		0,
		|		ВыданныеСИЗОстатки.КоличествоОстаток,
		|		0,
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		ВыданныеСИЗОстатки.ОснованиеВыдачи,
		|		ВыданныеСИЗОстатки.ДокументВыдачи
		|	ИЗ
		|		РегистрНакопления.ВыданныеСИЗ.Остатки(&ТекущаяДата, ФизическоеЛицо = &ФизическоеЛицо) КАК ВыданныеСИЗОстатки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыдачиСИЗПоНоменклатуре.СрезПоследних(&ТекущаяДата) КАК ВыдачиСИЗПоНоменклатуре
		|			ПО ВыданныеСИЗОстатки.ФизическоеЛицо = ВыдачиСИЗПоНоменклатуре.ФизическоеЛицо
		|			И ВыданныеСИЗОстатки.СИЗ = ВыдачиСИЗПоНоменклатуре.СИЗ
		|			И ВыданныеСИЗОстатки.ОснованиеВыдачи = ВыдачиСИЗПоНоменклатуре.ОснованиеВыдачи
		|			И ВыданныеСИЗОстатки.ДокументВыдачи = ВыдачиСИЗПоНоменклатуре.ДокументВыдачи
		|			И ВыдачиСИЗПоНоменклатуре.ДатаСледующейВыдачи <= &ТекущаяДата
		|	ГДЕ
		|		ВыданныеСИЗОстатки.КоличествоОстаток > 0
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ВыданныеСИЗОстатки.СИЗ,
		|		ВыданныеСИЗОстатки.ЕдиницаИзмерения,
		|		0,
		|		0,
		|		0,
		|		0,
		|		ВыданныеСИЗОстатки.КоличествоОстаток,
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		"""",
		|		ВыданныеСИЗОстатки.ОснованиеВыдачи,
		|		ВыданныеСИЗОстатки.ДокументВыдачи
		|	ИЗ
		|		РегистрНакопления.ВыданныеСИЗ.Остатки(&ТекущаяДата, ФизическоеЛицо = &ФизическоеЛицо) КАК ВыданныеСИЗОстатки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыдачиСИЗПоНоменклатуре.СрезПоследних(&ТекущаяДата) КАК ВыдачиСИЗПоНоменклатуре
		|			ПО ВыданныеСИЗОстатки.ФизическоеЛицо = ВыдачиСИЗПоНоменклатуре.ФизическоеЛицо
		|			И ВыданныеСИЗОстатки.СИЗ = ВыдачиСИЗПоНоменклатуре.СИЗ
		|			И ВыданныеСИЗОстатки.ОснованиеВыдачи = ВыдачиСИЗПоНоменклатуре.ОснованиеВыдачи
		|			И ВыданныеСИЗОстатки.ДокументВыдачи = ВыдачиСИЗПоНоменклатуре.ДокументВыдачи
		|			И ВыдачиСИЗПоНоменклатуре.ДатаСледующейВыдачи > &ТекущаяДата
		|			И ВыдачиСИЗПоНоменклатуре.ДатаСледующейВыдачи <= &ДатаСледующегоМесяца
		|	ГДЕ
		|		ВыданныеСИЗОстатки.КоличествоОстаток > 0) КАК ОбъединенныйЗапрос
		|СГРУППИРОВАТЬ ПО
		|	ОбъединенныйЗапрос.СИЗ,
		|	ОбъединенныйЗапрос.НормаВыдачи,
		|	ОбъединенныйЗапрос.НаРуках,
		|	ОбъединенныйЗапрос.ОжидаетВыдачи,
		|	ОбъединенныйЗапрос.НужноОбновить,
		|	ОбъединенныйЗапрос.ДоВыдачиМеньшеМесяца,
		|	ОбъединенныйЗапрос.ТребуетсяСписание,
		|	ОбъединенныйЗапрос.Заказано,
		|	ОбъединенныйЗапрос.Выдано,
		|	ОбъединенныйЗапрос.ЕдиницаИзмерения";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СостоянияВыдачиСИЗСотрудника.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		УстановитьСостояниеВыдачиНоменклатурыСИЗ(НоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСостояниеВыдачиНоменклатурыСИЗ(СтрокаСостояний)
	
	ШаблонСтроки = НСтр("ru = '%1 %2'");
	Если СтрокаСостояний.Количество > 0 Тогда
		СтрокаСостояний.НормаВыдачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСтроки, СтрокаСостояний.Количество, СтрокаСостояний.ЕдиницаИзмерения);
	КонецЕсли;
	Если СтрокаСостояний.КоличествоНаРуках > 0 Тогда
		СтрокаСостояний.НаРуках = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСтроки, СтрокаСостояний.КоличествоНаРуках, СтрокаСостояний.ЕдиницаИзмерения);
	КонецЕсли;
	Если СтрокаСостояний.КоличествоЗаказано > 0 Тогда
		СтрокаСостояний.Заказано = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСтроки, СтрокаСостояний.КоличествоЗаказано, СтрокаСостояний.ЕдиницаИзмерения);
	КонецЕсли;
	
	СтрокаСостояний.КоличествоОжидаетВыдачи = СтрокаСостояний.Количество - СтрокаСостояний.КоличествоНаРуках;
	СтрокаСостояний.КоличествоТребуетсяСписание = СтрокаСостояний.КоличествоНаРуках - СтрокаСостояний.Количество;
	
	Если СтрокаСостояний.КоличествоТребуетсяСписание > 0 Тогда
		СтрокаСостояний.КоличествоНужноОбновить = СтрокаСостояний.КоличествоНужноОбновить - СтрокаСостояний.КоличествоТребуетсяСписание;
		СтрокаСостояний.ТребуетсяСписание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСтроки, СтрокаСостояний.КоличествоТребуетсяСписание, СтрокаСостояний.ЕдиницаИзмерения);
	КонецЕсли;
	Если СтрокаСостояний.КоличествоНужноОбновить > 0 Тогда
		СтрокаСостояний.НужноОбновить = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСтроки, СтрокаСостояний.КоличествоНужноОбновить, СтрокаСостояний.ЕдиницаИзмерения);
	КонецЕсли;
	Если СтрокаСостояний.КоличествоОжидаетВыдачи > 0 Тогда
		СтрокаСостояний.ОжидаетВыдачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСтроки, СтрокаСостояний.КоличествоОжидаетВыдачи, СтрокаСостояний.ЕдиницаИзмерения);
	КонецЕсли;
	Если СтрокаСостояний.КоличествоДоВыдачиМеньшеМесяца > 0 Тогда
		СтрокаСостояний.ДоВыдачиМеньшеМесяца = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСтроки, СтрокаСостояний.КоличествоДоВыдачиМеньшеМесяца, СтрокаСостояний.ЕдиницаИзмерения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
